insert into subject (sbj_area, sbj_group, sbj_type, sbj_name, unit)
values ('기초', '국어', '일반', '화법과 작문', 3);
insert into subject (sbj_area, sbj_group, sbj_type, sbj_name, unit)
values ('기초', '국어', '일반', '언어와매체', 3);
insert into subject (sbj_area, sbj_group, sbj_type, sbj_name, unit)
values ('기초', '국어', '진로', '심화국어', 3);
insert into subject (sbj_area, sbj_group, sbj_type, sbj_name, unit)
values ('기초', '수학', '일반', '미적분', 3);
insert into subject (sbj_area, sbj_group, sbj_type, sbj_name, unit)
values ('기초', '수학', '진로', '경제수학', 3);
insert into subject (sbj_area, sbj_group, sbj_type, sbj_name, unit)
values ('기초', '수학', '진로', '심화수학Ⅰ', 3);
insert into subject (sbj_area, sbj_group, sbj_type, sbj_name, unit)
values ('기초', '영어', '진로', '영미문학읽기', 3);
insert into subject (sbj_area, sbj_group, sbj_type, sbj_name, unit)
values ('탐구', '사회', '일반', '윤리와 사상', 3);
insert into subject (sbj_area, sbj_group, sbj_type, sbj_name, unit)
values ('탐구', '사회', '일반', '한국지리', 3);
insert into subject (sbj_area, sbj_group, sbj_type, sbj_name, unit)
values ('탐구', '사회', '일반', '사회문화', 3);
insert into subject (sbj_area, sbj_group, sbj_type, sbj_name, unit)
values ('탐구', '사회', '일반', '동아시아사', 3);
insert into subject (sbj_area, sbj_group, sbj_type, sbj_name, unit)
values ('탐구', '과학', '진로', '물리학Ⅱ', 3);
insert into subject (sbj_area, sbj_group, sbj_type, sbj_name, unit)
values ('탐구', '과학', '진로', '화학Ⅱ', 3);
insert into subject (sbj_area, sbj_group, sbj_type, sbj_name, unit)
values ('탐구', '과학', '진로', '생명과학Ⅱ', 3);
insert into subject (sbj_area, sbj_group, sbj_type, sbj_name, unit)
values ('탐구', '과학', '진로', '지구과학Ⅱ', 3);
insert into subject (sbj_area, sbj_group, sbj_type, sbj_name, unit)
values ('탐구', '체육', '진로', '체육 전공실기 기초', 3);
insert into subject (sbj_area, sbj_group, sbj_type, sbj_name, unit)
values ('탐구', '예술', '진로', '미술 전공 실기', 3);
insert into subject (sbj_area, sbj_group, sbj_type, sbj_name, unit)
values ('탐구', '과학', '진로', '음악 전공 실기', 2);
insert into subject (sbj_area, sbj_group, sbj_type, sbj_name, unit)
values ('탐구', '사회', '진로', '여행지리', 2);
insert into subject (sbj_area, sbj_group, sbj_type, sbj_name, unit)
values ('탐구', '사회', '진로', '고전과윤리', 2);
insert into subject (sbj_area, sbj_group, sbj_type, sbj_name, unit)
values ('탐구', '과학', '진로', '과학사', 2);
insert into subject (sbj_area, sbj_group, sbj_type, sbj_name, unit)
values ('탐구', '과학', '진로', '융합과학탐구', 2);
insert into subject (sbj_area, sbj_group, sbj_type, sbj_name, unit)
values ('생활교양', '기술가정', '진로', '정보과학', 2);
insert into subject (sbj_area, sbj_group, sbj_type, sbj_name, unit)
values ('생활교양', '제2외국어', '진로', '중국어 회화1', 2);
insert into subject (sbj_area, sbj_group, sbj_type, sbj_name, unit)
values ('생활교양', '제2외국어', '진로', '일본어 회화1', 2);
insert into subject (sbj_area, sbj_group, sbj_type, sbj_name, unit)
values ('생활교양', '교양', '일반', '논술', 2);
insert into subject (sbj_area, sbj_group, sbj_type, sbj_name, unit)
values ('생활교양', '교양', '일반', '논리학', 2);
insert into subject (sbj_area, sbj_group, sbj_type, sbj_name, unit)
values ('생활교양', '교양', '일반', '환경', 2);
insert into subject (sbj_area, sbj_group, sbj_type, sbj_name, unit)
values ('생활교양', '교양', '일반', '철학', 2);
insert into subject (sbj_area, sbj_group, sbj_type, sbj_name, unit)
values ('생활교양', '교양', '일반', '보건', 2);
insert into subject (sbj_area, sbj_group, sbj_type, sbj_name, unit)
values ('체육예술', '체육', '일반', '운동과건강', 3);
insert into subject (sbj_area, sbj_group, sbj_type, sbj_name, unit)
values ('체육예술', '예술', '일반', '미술', 3);
insert into subject (sbj_area, sbj_group, sbj_type, sbj_name, unit)
values ('기초', '수학', '일반', '확률과통계', 3);
insert into subject (sbj_area, sbj_group, sbj_type, sbj_name, unit)
values ('기초', '영어', '일반', '영어독해와작문', 3);

-- 240개의 insert 쿼리문 생성
INSERT INTO student (stu_name, school_number, gender)
VALUES ('홍길동1', '30101', 'M'),
       ('홍길동2', '30102', 'F'),
       ('홍길동3', '30103', 'M'),
       ('홍길동4', '30104', 'F'),
       ('홍길동5', '30105', 'M'),
       ('홍길동6', '30106', 'F'),
       ('홍길동7', '30107', 'M'),
       ('홍길동8', '30108', 'F'),
       ('홍길동9', '30109', 'M'),
       ('홍길동11', '30111', 'M'),
       ('홍길동12', '30112', 'F'),
       ('홍길동13', '30113', 'M'),
       ('홍길동14', '30114', 'F'),
       ('홍길동15', '30115', 'M'),
       ('홍길동16', '30116', 'F'),
       ('홍길동17', '30117', 'M'),
       ('홍길동18', '30118', 'F'),
       ('홍길동19', '30119', 'M'),
       ('홍길동20', '30120', 'F'),
       ('홍길동21', '30121', 'M'),
       ('홍길동22', '30122', 'F'),
       ('홍길동23', '30123', 'M'),
       ('홍길동24', '30124', 'F'),
       ('홍길동25', '30125', 'M'),
       ('홍길동26', '30126', 'F'),
       ('홍길동27', '30127', 'M'),
       ('홍길동28', '30128', 'F'),
       ('홍길동29', '30129', 'M'),
       ('홍길동30', '30130', 'F'),
       ('홍길동31', '30131', 'M'),
       ('홍길동32', '30132', 'F'),
       ('홍길동33', '30133', 'M'),
       ('홍길동34', '30134', 'F'),
       ('홍길동35', '30135', 'M'),
       ('홍길동36', '30136', 'F'),
       ('홍길동37', '30137', 'M'),
       ('홍길동38', '30138', 'F'),
       ('홍길동39', '30139', 'M'),
       ('홍길동40', '30140', 'F'),
       ('홍길동41', '30141', 'M'),
       ('홍길동42', '30142', 'F'),
       ('홍길동43', '30143', 'M'),
       ('홍길동44', '30144', 'F'),
       ('홍길동45', '30145', 'M'),
       ('홍길동46', '30146', 'F'),
       ('홍길동47', '30147', 'M'),
       ('홍길동48', '30148', 'F'),
       ('홍길동49', '30149', 'M'),
       ('홍길동50', '30150', 'F'),
       ('홍길동51', '30151', 'M'),
       ('홍길동52', '30152', 'F'),
       ('홍길동53', '30153', 'M'),
       ('홍길동54', '30154', 'F'),
       ('홍길동55', '30155', 'M'),
       ('홍길동56', '30156', 'F'),
       ('홍길동57', '30157', 'M'),
       ('홍길동58', '30158', 'F'),
       ('홍길동59', '30159', 'M'),
       ('홍길동60', '30160', 'F'),
       ('홍길동61', '30161', 'M'),
       ('홍길동62', '30162', 'F'),
       ('홍길동63', '30163', 'M'),
       ('홍길동64', '30164', 'F'),
       ('홍길동65', '30165', 'M'),
       ('홍길동66', '30166', 'F'),
       ('홍길동67', '30167', 'M'),
       ('홍길동68', '30168', 'F'),
       ('홍길동69', '30169', 'M'),
       ('홍길동70', '30170', 'F'),
       ('홍길동71', '30171', 'M'),
       ('홍길동72', '30172', 'F'),
       ('홍길동73', '30173', 'M'),
       ('홍길동74', '30174', 'F'),
       ('홍길동75', '30175', 'M'),
       ('홍길동76', '30176', 'F'),
       ('홍길동77', '30177', 'M'),
       ('홍길동78', '30178', 'F'),
       ('홍길동79', '30179', 'M'),
       ('홍길동80', '30180', 'F'),
       ('홍길동81', '30181', 'M'),
       ('홍길동82', '30182', 'F'),
       ('홍길동83', '30183', 'M'),
       ('홍길동84', '30184', 'F'),
       ('홍길동85', '30185', 'M'),
       ('홍길동86', '30186', 'F'),
       ('홍길동87', '30187', 'M'),
       ('홍길동88', '30188', 'F'),
       ('홍길동89', '30189', 'M'),
       ('홍길동90', '30190', 'F'),
       ('홍길동91', '30191', 'M'),
       ('홍길동92', '30192', 'F'),
       ('홍길동93', '30193', 'M'),
       ('홍길동94', '30194', 'F'),
       ('홍길동95', '30195', 'M'),
       ('홍길동96', '30196', 'F'),
       ('홍길동97', '30197', 'M'),
       ('홍길동98', '30198', 'F'),
       ('홍길동99', '30199', 'M'),
       ('홍길동100', '30200', 'F'),
       ('홍길동101', '30201', 'M'),
       ('홍길동102', '30202', 'F'),
       ('홍길동103', '30203', 'M'),
       ('홍길동104', '30204', 'F'),
       ('홍길동105', '30205', 'M'),
       ('홍길동106', '30206', 'F'),
       ('홍길동107', '30207', 'M'),
       ('홍길동108', '30208', 'F'),
       ('홍길동109', '30209', 'M'),
       ('홍길동110', '30210', 'F'),
       ('홍길동111', '30211', 'M'),
       ('홍길동112', '30212', 'F'),
       ('홍길동113', '30213', 'M'),
       ('홍길동114', '30214', 'F'),
       ('홍길동115', '30215', 'M'),
       ('홍길동116', '30216', 'F'),
       ('홍길동117', '30217', 'M'),
       ('홍길동118', '30218', 'F'),
       ('홍길동119', '30219', 'M'),
       ('홍길동120', '30220', 'F'),
       ('홍길동121', '30221', 'M'),
       ('홍길동122', '30222', 'F'),
       ('홍길동123', '30223', 'M'),
       ('홍길동124', '30224', 'F'),
       ('홍길동125', '30225', 'M'),
       ('홍길동126', '30226', 'F'),
       ('홍길동127', '30227', 'M'),
       ('홍길동128', '30228', 'F'),
       ('홍길동129', '30229', 'M'),
       ('홍길동130', '30230', 'F'),
       ('홍길동131', '30231', 'M'),
       ('홍길동132', '30232', 'F'),
       ('홍길동133', '30233', 'M'),
       ('홍길동134', '30234', 'F'),
       ('홍길동135', '30235', 'M'),
       ('홍길동136', '30236', 'F'),
       ('홍길동137', '30237', 'M'),
       ('홍길동138', '30238', 'F'),
       ('홍길동139', '30239', 'M'),
       ('홍길동140', '30240', 'F'),
       ('홍길동141', '30241', 'M'),
       ('홍길동142', '30242', 'F'),
       ('홍길동143', '30243', 'M'),
       ('홍길동144', '30244', 'F'),
       ('홍길동145', '30245', 'M'),
       ('홍길동146', '30246', 'F'),
       ('홍길동147', '30247', 'M'),
       ('홍길동148', '30248', 'F'),
       ('홍길동149', '30249', 'M'),
       ('홍길동150', '30250', 'F'),
       ('홍길동151', '30251', 'M'),
       ('홍길동152', '30252', 'F'),
       ('홍길동153', '30253', 'M'),
       ('홍길동154', '30254', 'F'),
       ('홍길동155', '30255', 'M'),
       ('홍길동156', '30256', 'F'),
       ('홍길동157', '30257', 'M'),
       ('홍길동158', '30258', 'F'),
       ('홍길동159', '30259', 'M'),
       ('홍길동160', '30260', 'F'),
       ('홍길동161', '30261', 'M'),
       ('홍길동162', '30262', 'F'),
       ('홍길동163', '30263', 'M'),
       ('홍길동164', '30264', 'F'),
       ('홍길동165', '30265', 'M'),
       ('홍길동166', '30266', 'F'),
       ('홍길동167', '30267', 'M'),
       ('홍길동168', '30268', 'F'),
       ('홍길동169', '30269', 'M'),
       ('홍길동170', '30270', 'F'),
       ('홍길동171', '30271', 'M'),
       ('홍길동172', '30272', 'F'),
       ('홍길동173', '30273', 'M'),
       ('홍길동174', '30274', 'F'),
       ('홍길동175', '30275', 'M'),
       ('홍길동176', '30276', 'F'),
       ('홍길동177', '30277', 'M'),
       ('홍길동178', '30278', 'F'),
       ('홍길동179', '30279', 'M'),
       ('홍길동180', '30280', 'F'),
       ('홍길동181', '30281', 'M'),
       ('홍길동182', '30282', 'F'),
       ('홍길동183', '30283', 'M'),
       ('홍길동184', '30284', 'F'),
       ('홍길동185', '30285', 'M'),
       ('홍길동186', '30286', 'F'),
       ('홍길동187', '30287', 'M'),
       ('홍길동188', '30288', 'F'),
       ('홍길동189', '30289', 'M'),
       ('홍길동190', '30290', 'F'),
       ('홍길동191', '30291', 'M'),
       ('홍길동192', '30292', 'F'),
       ('홍길동193', '30293', 'M'),
       ('홍길동194', '30294', 'F'),
       ('홍길동195', '30295', 'M'),
       ('홍길동196', '30296', 'F'),
       ('홍길동197', '30297', 'M'),
       ('홍길동198', '30298', 'F'),
       ('홍길동199', '30299', 'M'),
       ('홍길동200', '30300', 'F'),
       ('홍길동201', '30301', 'M'),
       ('홍길동202', '30302', 'F'),
       ('홍길동203', '30303', 'M'),
       ('홍길동204', '30304', 'F'),
       ('홍길동205', '30305', 'M'),
       ('홍길동206', '30306', 'F'),
       ('홍길동207', '30307', 'M'),
       ('홍길동208', '30308', 'F'),
       ('홍길동209', '30309', 'M'),
       ('홍길동210', '30310', 'F'),
       ('홍길동211', '30311', 'M'),
       ('홍길동212', '30312', 'F'),
       ('홍길동213', '30313', 'M'),
       ('홍길동214', '30314', 'F'),
       ('홍길동215', '30315', 'M'),
       ('홍길동216', '30316', 'F'),
       ('홍길동217', '30317', 'M'),
       ('홍길동218', '30318', 'F'),
       ('홍길동219', '30319', 'M'),
       ('홍길동220', '30320', 'F'),
       ('홍길동221', '30321', 'M'),
       ('홍길동222', '30322', 'F'),
       ('홍길동223', '30323', 'M'),
       ('홍길동224', '30324', 'F'),
       ('홍길동225', '30325', 'M'),
       ('홍길동226', '30326', 'F'),
       ('홍길동227', '30327', 'M'),
       ('홍길동228', '30328', 'F'),
       ('홍길동229', '30329', 'M'),
       ('홍길동230', '30330', 'F'),
       ('홍길동231', '30331', 'M'),
       ('홍길동232', '30332', 'F'),
       ('홍길동233', '30333', 'M'),
       ('홍길동234', '30334', 'F'),
       ('홍길동235', '30335', 'M'),
       ('홍길동236', '30336', 'F'),
       ('홍길동237', '30337', 'M'),
       ('홍길동238', '30338', 'F'),
       ('홍길동239', '30339', 'M'),
       ('홍길동240', '30340', 'F');